<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_14(8%EC%9B%941%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [10]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]
l2 = [{'name': 'Ed', 'job':"dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]
l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

In [12]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [13]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [14]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [18]:
result = pd.concat([df1,df2], ignore_index=True) # pd.concat을 이용해 두개의 데이터프레임 합치기(행으로 합친 경우)

In [19]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [23]:
result = df1.append(df2, ignore_index=True) # append를 이용해 합치기(행으로 합친 경우)

In [24]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [25]:
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [26]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [27]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [28]:
result = pd.concat([df1,df2],axis=1, ignore_index=True) # pd.concat으로 데이터프레이미 합치기(열로 합칠 경우)

In [29]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [30]:
label = [1,2,3,4,5] 
prediction = [1,2,2,4,4] # list 합치기

In [31]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction}) # comparison을 이용해 list 합치기

In [32]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4